The construction gbXML type. This value corresponds to the 'id' property of a constructionType node in Constructions.xml.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public string AnalyticConstructionTypeId { get; }
  Visual Basic
Public ReadOnly Property AnalyticConstructionTypeId As String
	Get
  Visual C++
public:
property String^ AnalyticConstructionTypeId {
	String^ get ();
}
 See Also
  FamilyThermalProperties Class
  Autodesk.Revit.DB Namespace